Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: There are a number of properties which control how the test process is launched.
zh_cn: 有大量的属性用于控制测试进程的启动。

source: There are a number of properties which you can set on an archive task.
zh_cn: 这里有很多你可以在归档任务中设置的属性。

source: There are a number of ways of doing this.
zh_cn: 对这样的情况，有很多种方法。

source: There are a number of ways that you can influence how Gradle resolves dependencies.
zh_cn: 有许多种方式都可以影响到Gradle解析依赖。

source: There are build tools that build up such a dependency graph as they execute their tasks.
zh_cn: 有许多构建工具在它们执行任务时生成了依赖关系图。

source: There are five elements you need to remember: allprojects, subprojects, evaluationDependsOn, evaluationDependsOnChildren and project lib dependencies.
zh_cn: 你需要记住的是五个元素：allprojects， subprojects，evaluationDependsOn， evaluationDependsOnChildren 和项目库依赖。

source: There are many configuration options for the Maven deployer.
zh_cn: Maven deployer有很多配置选项。

source: There are many options for the protocol to communicate with the repository (e.g. filesystem, http, ssh, ...)
zh_cn: 对于与仓库通信的协议，有很多的选项（比如文件系统，http， ssh……）

source: There are many situation when you want to use the latest version of a particular dependency, or the latest in a range of versions.
zh_cn: 有许多情况，是你想要使用一个特定依赖的最新版本，或者是某个版本范围内的最新版。

source: There are many tools out there which still use standard output for logging.
zh_cn: 有很多的工具仍然在使用标准输出进行日志记录。

source: There are many use cases for custom configurations.
zh_cn: 关于自定义配置，有许多的用例。

source: There are other situations where it is necessary to fine-tune dependency declarations.
zh_cn: 还有一些其他的情况，需要调整依赖声明。

source: There are separate settings for HTTPS.
zh_cn: 对于 HTTPS 有单独的设置。

source: There are several different types of dependencies that you can declare:
zh_cn: 你可以声明几种不同类型的依赖：

source: There are several different types of repositories you can declare:
zh_cn: 有几种不同类型的存储库可以声明：

source: There are several places where you can put the source for the task class.
zh_cn: 有几个地方可以让你放任务类的源码。

source: There are several ways to get an Ant reference:
zh_cn: 有几种方法可以获取 Ant 引用：

source: There are several ways to get the value of these properties.
zh_cn: 有几种方法来获取这些属性值。

source: There are several ways to set an Ant property, so that the property can be used by Ant tasks.
zh_cn: 有几种方法来设置 Ant 属性，以便使该属性被 Ant 任务使用。

source: There are several ways to set an Ant reference:
zh_cn: 有几种方法可以设置 Ant 引用：

source: There are several ways you can define the dependencies of a task.
zh_cn: 定义任务的依赖关系有几种方法。

source: There are two Gradle-specific log levels, in addition to the ones you might normally see.
zh_cn: 除了那些您可能通常都会看到的日志级别之外，还有两个 Gradle 特定日志级别。

source: There are two kinds of variables that can be declared in a build script: local variables and extra properties.
zh_cn: 有两类可以在生成脚本中声明的变量： 局部变量和额外属性。

source: There are two ordering rules available: "must run after" and "should run after".
zh_cn: 有两种排序规则是可用的："必须在之后运行"和"应该在之后运行"。

source: There is a 1:1 mapping from the Ant/Ivy log levels to the Gradle log levels, except the Ant/Ivy TRACE log level, which is mapped to Gradle DEBUG log level.
zh_cn: 从 Ant/Ivy 的日志级别到 Gradle 的日志级别是一对一的映射，除了 Ant/Ivy 的 TRACE级别之外，它是映射到Gradle 的 DEBUG 级别的。

source: There is a better solution (works only if the tasks that need the directory have a dependsOn relationship):
zh_cn: 这里有一个更好的解决方案 (仅适用于这些需要这个目录的任务有着dependsOn的关系的情况)：

source: There is a common situation, that multiple tasks depend on the existence of a directory.
zh_cn: 有一个常见的情况是，多个任务都依赖于某个目录的存在。

source: There is a daemon log file, which by default is located in the Gradle user home directory.
zh_cn: 默认情况下位于 Gradle 用户主目录有一个守护进程的日志文件。

source: There is a map-based syntax for defining an artifact using a file.
zh_cn: 有一个基于map的语法来定义一个构件使用文件。

source: There is a string notation and a map notation.
zh_cn: 有 string 标记法和 map 标记法。

source: There is a very simple mapping from Ant's build.xml format to Groovy, which is explained below.
zh_cn: 从 Ant 的 build.xml格式到 Groovy 之间有一个非常简单的映射，下面解释。

source: There is also a sourceSets { } script block, which you can pass a closure to configure the source set container.
zh_cn: 除此之后，还有一个sourceSets {}的脚本块，可以传入一个闭包来配置源集容器。

source: There is also a filter so that uncommon tasks can be hidden.
zh_cn: 这里还提供了一个过滤器，可以把比较少用的任务隐藏。

source: There is also a stand-alone TestReport task type which can generate the HTML test report from the binary results generated by one or more Test task instances.
zh_cn: 这里还有一个独立的TestReport任务类型，它可以从一个或多个Test任务实例生成的二进制结果中生成 HTML 测试报告。

source: There is also an aggregating task that depends on all report tasks added by the plugin.
zh_cn: 这里也有一个聚合的任务，它依赖于由该插件添加的所有的报告任务。

source: There is an alternative syntax for defining tasks, which you may prefer to use:
zh_cn: 对于定义任务，有一种替代的语法你可能更愿意使用：

source: There is another way of configuring a task.
zh_cn: 还有另一种配置任务的方式。

source: There is another way to deal with transitive dependencies without XML descriptor files.
zh_cn: 还有另外一种方法，用于处理没有XML 描述符文件的传递依赖。

source: There is even a third dependency.
zh_cn: 这里甚至有第三个依赖。

source: There is much more to say about multi-project builds in the chapter dedicated to this topic (see Chapter 56, Multi-project Builds).
zh_cn: 关于多项目构建，在这一主题的章节中有更多的介绍（参见 第 56 章, 多项目构建)。

source: There is no need to create a “stub” build.gradle file in order to apply the plugin.
zh_cn: 那里不需要创建一个“存根” build.gradle文件以应用该插件。

source: There is some more work to do if you need support for other protocols than file.
zh_cn: 如果你需要支持文件之外的其他协议，那么你还需要再做一些事情。

source: Therefore :consumer:action is executed before :producer:action.
zh_cn: 因此:consumer:action会在:producer:action之前执行。

source: Therefore it is likely that you don't have to define configuration dependencies explicitly.
zh_cn: 因此，很可能你不需要显式地定义配置依赖。

source: Therefore only multi-project builds can take advantage of parallel execution.
zh_cn: 因此并行执行只对多项目构建有用。

source: Therefore the consumer project is evaluated before the producer project and the key value of the producer is set after it is read by the consumer project.
zh_cn: 因此consumer项目评估会在producer项目之前，并且producer的key值在它被consumer项目读取后设置。

source: Therefore they are strictly speaking build configuration scripts.
zh_cn: 因此严格来说，它们都是构建配置脚本。

source: Therefore we have no circular dependency.
zh_cn: 因此，我们没有循环依赖。

source: Therefore you can't use the -P option.
zh_cn: 那么，您就不能使用-P选项。

source: Therefore, Gradle will not fail when an unknown property is set.
zh_cn: 因此，当未知的属性被设置时，Gradle不会构建失败。

source: These JVM arguments are applied to the run task and also considered in the generated start scripts of your distribution.
zh_cn: 这些 JVM 参数会被应用于run 任务，以及生成的 distrubution 的启动脚本。

source: These are evaluated relative to the project directory, as per the file() method, described in Section 16.1, “Locating files”.
zh_cn: 根据 16.1 章节 “定位文件”里对file()方法的描述，它的结果会被计算为相对于项目目录的相对路径。

source: These are flattened and the contents converted to File instances.
zh_cn: 它们会被展开，并且内容会转换为 File 实例。

source: These are flattened and the contents included in the file collection.
zh_cn: 它们会被展开，并且内容会被包含在文件集合内。

source: These are listed below in Table 16.1, “Archive tasks - naming properties”.
zh_cn: 它们在以下的表 16.1，"存档任务-命名属性"中列出。

source: These are listed below.
zh_cn: 如下列所示：

source: These binaries may vary based on the tool chain used to build, the compiler/linker flags supplied, the dependencies provided, or additional source files provided.
zh_cn: 基于构建所使用的工具链，提供的编译器/链接器标志，提供的依赖或其他源文件，这些二进制文件可能会发生变化。

source: These can be complex commands (anything that's legal to Gradle) and you can provide them with a display name.
zh_cn: 这些命令可以是复杂的命令（只要它们符合 Gradle 的语法），你可以给它们设置一个显示名称。

source: These convention properties are provided by a convention object of type ProjectReportsPluginConvention.
zh_cn: 这些属性由一个ProjectReportsPluginConvention 的约定对象提供。

source: These convention properties are provided by a convention object of type ScalaSourceSet.
zh_cn: 这些属性由一个ScalaSourceSet 的约定对象提供。

source: These digital signatures can then be used to prove who built the artifact the signature is attached to as well as other information such as when the signature was generated.
zh_cn: 这些数字签名可以用于证明使用这个签名的artifact是谁构建的，以及其他的信息，比如签名是什么时候生成的。

source: These imports are customizable (see Appendix E, Existing IDE Support and how to cope without it).
zh_cn: 这些导入是可自定义的 （见附录 E，现有的 IDE 支持和没有支持时如何应对）。

source: These items must be supplied as the property projects signing.keyId, signing.password and signing.secretKeyRingFile respectively.
zh_cn: 这些条目必须分别作为属性项目signing.keyId、 signing.password和signing.secretKeyRingFile 进行提供。

source: These libraries form a 'releasable unit', designed and intended to be used as a whole.
zh_cn: 这些库形成一个“可发布的单位”，被设计并打算作为一个整体使用。

source: These method accept a task instance, a task name or any other input accepted by Task.dependsOn().
zh_cn: 这些方法接受一个任务实例、 任务名称或Task.dependsOn()所接受的任何其他输入作为参数。

source: These methods return a FileTree instance which you can use like any other file tree or file collection.
zh_cn: 这些方法返回一个FileTree实例，您可以像使用任何其他文件树或文件集合一样使用它。

source: These model objects are then merged with the existing Eclipse XML metadata to ultimately generate new metadata.
zh_cn: 然后把这些模型对象与现有的 Eclipse XML 元数据进行合并，最终生成新的元数据。

source: These notifications generally take 2 forms: You can either implement a particular listener interface, or you can provide a closure to execute when the notification is fired.
zh_cn: 这些通知一般采取两种形式︰你也可以实现一个特定的监听接口，或提供一个用于在收到通知时执行的闭包。

source: These plugins add support for various languages which can be compiled for and executed in the JVM.
zh_cn: 这些插件添加了让各种语言可以被编译和在JVM执行的支持。

source: These plugins add support for various languages:
zh_cn: 这些插件添加了对多种语言的支持：

source: These plugins form the basic building blocks which the other plugins are assembled from.
zh_cn: 这些插件组成了基本的构建块，其他插件都由此组装而来。

source: These plugins provide help with your software development process.
zh_cn: 这些插件提供一些软件开发过程上的帮助。

source: These plugins provide some integration with various runtime technologies.
zh_cn: 以下这些插件提供了一些与各种运行时技术的集成。

source: These properties are provided by a EarPluginConvention convention object.
zh_cn: 这些属性由一个EarPluginConvention 公约对象提供。

source: These properties are provided by a JettyPluginConvention convention object.
zh_cn: 这些属性都由一个JettyPluginConvention公约对象提供。

source: These properties are provided by a MavenPluginConvention convention object.
zh_cn: 这些属性由一个MavenPluginConvention 的约定对象提供。

source: These properties are provided by a WarPluginConvention convention object.
zh_cn: 这些属性由一个WarPluginConvention公约对象提供。

source: These properties are provided by a convention object of type GroovySourceSet.
zh_cn: 这些属性由一个GroovySourceSet 的约定对象提供。

source: These properties are provided by convention objects of type JavaPluginConvention, BasePluginConvention and ReportingBasePluginConvention.
zh_cn: 这些属性由JavaPluginConvention， BasePluginConvention和ReportingBasePluginConvention这些类型的常规对象提供。

source: These properties can be set directly in the build script; for example System.setProperty('http.proxyHost', 'www.somehost.org') for the proxy host.
zh_cn: 这些属性可以直接在构建脚本中设置；例如设置代理主机为 System.setProperty （'http.proxyHost', 'www.somehost.org'）。

source: These settings can be applied to all binaries, an individual binary, or selectively to a group of binaries based on some criteria.
zh_cn: 这些设置可以应用于所有的二进制文件，单个二进制文件，或选择性地应用于基于某些条件的一组二进制文件。

source: These source files may include Java source files and resource files.
zh_cn: 这些源文件可能包括 Java 源代码文件和资源文件。

source: These test suite binaries can be configured in a similar way to any other binary instance:
zh_cn: 这些测试套件二进制文件可以以一种类似的方式配置到任何其他二进制的实例︰

source: They all work the same way, so let's look at how you create a ZIP file.
zh_cn: 他们的工作方式都一样，所以让我们看看如何创建一个 ZIP 文件。

source: They also provide a very low level hook for working directly with the raw XML for adjustment before it is persisted, for fine tuning and configuration that the Eclipse plugin does not model.
zh_cn: 他们还提供了一个非常低级别的hook，用于直接处理原始 XML 持久化之前的调整，微调和配置使 Eclipse 插件不进行建模。

source: They are a replacement for a module descriptor in an external repository.
zh_cn: 它们是外部库的模块描述符的替代者。

source: They are available for you to use in your build files, and are listed here for completeness.
zh_cn: 它们可供你在你的构建文件中使用，并在此处完整列出。

source: They are joined by Gradle with the , separator.
zh_cn: 他们由 Gradle 使用,分隔符连接。

source: They are only visible in the scope where they have been declared.
zh_cn: 它们只在定义它们的范围内可以被访问。

source: They can be further customized via the MavenPom API.
zh_cn: 它们可以通过MavenPom API 进一步定制化。

source: They had only Configuration Dependencies.
zh_cn: 它们只有配置依赖。

source: They refer to a module in an external repository.
zh_cn: 它们引用外部仓库中的模块。

source: They take effect after a module's descriptor has been downloaded, but before it has been selected among all candidate versions.
zh_cn: 它们在模块描述符下载之后，被所有候选版本之间选择之前生效。

source: Think about a developer who decides to install version 3.0.5 of Hibernate on her machine to fix a critical security bug but forgets to notify others in the team of this change.
zh_cn: 想一下一个开发人员决定在她的机器安装 3.0.5 的版本，以修复一个关键的安全 bug，但她忘记通知其他团队这个变化。

source: Third party plugins
zh_cn: 第三方插件

source: This AntBuilder is used to access Ant tasks, types and properties from your build script.
zh_cn: AntBuilder 用于从你的构建脚本中访问 Ant 任务、 类型和属性。

source: This API provides properties and configuration methods.
zh_cn: 该 API 提供了一些属性和配置方法。

source: This ability is added by the visual-studio plugin.
zh_cn: 这个功能是通过 visual-studio 插件添加的。

source: This ability to configure properties of objects to reflect the value of another object's task at all times (i.e. even when it changes) is known as “convention mapping”.
zh_cn: 这种配置对象的属性以在所有时间内（甚至当它更改的时候）反映另一个对象的任务的值的能力被称为“映射约定”。

source: This adds a Zip archive task with the name myZip which produces ZIP file zipProject-1.0.zip.
zh_cn: 它添加了一个名称为myZip的ZIP归档任务，产生 ZIP 文件 zipProject 1.0.zip。

source: This adds repositories which look into one or more directories for finding dependencies.
zh_cn: 这将会添加一些用于查找依赖的仓库，它会在一个或多个目录中寻找。

source: This adds them to the filter.
zh_cn: 这将会把它们添加到过滤器中。

source: This allows you to run the executable without needing to install the shared libraries in their final locations.
zh_cn: 它允许你运行可执行文件，而无需在其最终的位置安装共享库。

source: This also applies the Java plugin to your project.
zh_cn: 它同样会将Java插件应用到你项目中。

source: This also applies the War plugin to your project.
zh_cn: 它会把War插件也应用到你的项目中。

source: This also has a consequence for the --stop command line instruction: You can only stop daemons that were started with the Gradle version you use when running --stop.
zh_cn: 这也有一种--stop命令行指令的结果： 当运行--stop时，您仅可以停止以你的Gradle版本启动的守护进程。

source: This also provides a place to try out commands before adding them to favorites.
zh_cn: 它也对要添加到收藏夹的命令提供了先去尝试的地方。

source: This applies the plugin if no task named wrapper is already defined in the build.
zh_cn: 如果在构建中已没有定义名为 wrapper 的任务，将会应用该插件。

source: This approach is fully supported by Gradle.
zh_cn: 这种做法 Gradle 也完全支持。

source: This approach is useful if the dependency in conflict is a transitive dependency.
zh_cn: 如果冲突中的依赖是传递依赖，那么这种方法会很有用。

source: This approach is useful if the dependency in conflict is already a first level dependency.
zh_cn: 如果冲突中的依赖已经是第一级的依赖，那么这种方法会很有用。

source: This behavior is configurable.
zh_cn: 这种行为是可配置的。

source: This behaviour is also available for your tasks, not just for built-in tasks.
zh_cn: 这种行在您自己定义的任务上也有效，而不仅仅是内置任务。

source: This build language is based on Groovy, with some additions to make it easier to describe a build.
zh_cn: 这种构建语言基于 Groovy 中，并进行了一些补充，使其易于描述构建。

source: This can also be enabled at invocation time via the --debug-jvm task option.
zh_cn: 这也可以在调用时通过--debug-vm task 选项进行启用。

source: This can be a requirement during development, or you may be developing a library that is designed to work with a range of dependency versions.
zh_cn: 这可以是在开发中需要，或者你可能正在开发一个库，它被设计为使用一个范围内的依赖版本。

source: This can be a useful alternative to giving your test process a very large heap.
zh_cn: 这是一个很有用的替代方案，让你的测试进程可以有很大的堆内存。

source: This can be extremely powerful.
zh_cn: 这将会非常强大。

source: This can be used to do things like performing additional configuration once all the definitions in a build script have been applied, or for some custom logging or profiling.
zh_cn: 这可以用来做一些事情，比如一旦构建脚本里的定义都被应用时执行额外的配置，或者做一些自定义的日志记录或分析。

source: This can be used to set some default values or add behaviour before the task is made available in the build file.
zh_cn: 这可以用来在构建脚本中的任务可用之前，设置一些默认值或添加行为。

source: This can be useful for doing things such as installing your application, creating an exploded copy of your archives, or maintaining a copy of the project's dependencies.
zh_cn: 这可以用来做一些事情，比如安装你的应用程序、 创建你的归档文件的exploded副本，或维护项目的依赖项的副本。

source: This can be useful if a certain dependency version is broken and should not be used, where a dependency resolve rule causes this version to be replaced with a known good version.
zh_cn: 如果某个依赖的版本坏了，并且不应该被使用，这个机制将非常有用。一个依赖解析规则将会使这个版本被替换为一个已知的好的版本。

source: This can be useful if you cannot, or do not want to, place certain files in a repository.
zh_cn: 这将会非常有用，比如你无法，或者是不想要把某些文件放到仓库。

source: This can be useful when dealing with sensitive information (e.g. credentials), environment information, or for ad-hoc configuration.
zh_cn: 当处理敏感信息 （例如证件），环境信息，或点对点配置时，这会非常有用。

source: This can be very useful when tackling version conflicts - for more information see Section 50.2.3, “Resolve version conflicts”.
zh_cn: 当解决版本冲突时，这可能非常有用——有关详细信息请参阅第 50.2.3 节，“解决版本冲突”。

source: This change was requested by Eclipse users who take advantage of war or ear plugin but they don't use Eclipse WTP.
zh_cn: 这种变化是Eclipse用户要求的，他们想利用war或ear插件，但又不想用 Eclipse WTP。

source: This chapter aims to serve as an introduction to plugins and Gradle and the role they play.
zh_cn: 这一章旨在作为对插件和 Gradle 及他们扮演的角色的导言。

source: This chapter describes a very simple Groovy project.
zh_cn: 这一章描述了一个很简单的Groovy项目。

source: This chapter describes the original publishing mechanism available in Gradle 1.0: in Gradle 1.3 a new mechanism for publishing was introduced.
zh_cn: 本章介绍的是在Gradle 1.0版本中的原始的发布机制：在Gradle 1.3 中我们引入了新的发布机制。

source: This chapter introduces some of the Gradle's support for web applications.
zh_cn: 这一章主要介绍Gradle对Web程序的一些支持。

source: This chapter introduces some of the basics of dependency management in Gradle.
zh_cn: 本章介绍了 Gradle 依赖管理的一些基础知识。

source: This chapter introduces the basics of the Gradle command-line.
zh_cn: 本章介绍 Gradle 命令行的基础知识。

source: This chapter is a work in progress
zh_cn: 此章节还在完善中。

source: This chapter is a work in progress.
zh_cn: 此章节还在完善中。

source: This chapter is about how you declare the outgoing artifacts of your project, and how to work with them (e.g. upload them).
zh_cn: 本章介绍如何声明你的项目的输出构件，以及如何使用它们（例如上传它们）。

source: This chapter is currently a work in progress.
zh_cn: 此章节目前还在完善中。

source: This chapter looks at some of the details of writing a build script.
zh_cn: 这一章着眼于一些编写构建脚本的详细信息。

source: This concept, also known from Ivy, models the different levels of maturity that a module transitions through over time.
zh_cn: 这一概念，也可以从 Ivy 中，随着时间推移，一个模块发展的成熟水平可以得知。

source: This configuration has by default only the default jar as an element.
zh_cn: 该项配置在默认情况下只包含默认的 jar 文件。

source: This creates a FileTree defined with a base directory, and optionally some Ant-style include and exclude patterns.
zh_cn: 它将定义一个基目录创建FileTree对象，并可以选择加上一些 Ant风格的包含与排除模式。

source: This creates a copy task with no default behavior.
zh_cn: 上面的代码创建了一个什么都没做的复制任务。

source: This declares a dependency on Groovy.
zh_cn: 这里定义了一个对 Groovy 的依赖。

source: This default platform does not specify any architecture or operatingSystem value, hence using the default values of the first available tool chain.
zh_cn: 该默认平台不指定任何architecture或operatingSystem的值，因此会使用第一个可用的工具链的默认值。

source: This dependency has a dependency on commons-codec.
zh_cn: 这个依赖又依赖于commons-codec。

source: This dependency will then be used on compile and runtime class paths.
zh_cn: 这个依赖会在编译和运行的类路径时用到。

source: This description is for example displayed when executing gradle tasks.
zh_cn: 例如，当执行gradle tasks时显示这个描述。

source: This description is shown when running for example gradle tasks.
zh_cn: 当对这个例子运行 gradle tasks 的时候，这个描述会被显示。

source: This determines how much information to write out stack traces when errors occur.
zh_cn: 这决定了当出现错误时，有多少信息定到堆栈跟踪。

source: This did not work out.
zh_cn: 它并没有成功。

source: This does not require dependent projects to be rebuilt (same as the -a option).
zh_cn: 这使得重新构建时不去依赖项目（与-a选项一样）

source: This example performs some custom logging of project evaluation.
zh_cn: 下面的例子是在执行项目评估的自定义日志记录。

source: This example uses method Project.afterEvaluate() to add a closure which is executed after the project is evaluated.
zh_cn: 上面的例子使用了Project.afterEvaluate()方法添加一个在project 评估之后执行的闭包。

source: This extension allows the configuration of the JaCoCo specific properties of the test task.
zh_cn: 该扩展允许配置 JaCoCo 中的测试任务的一些特定属性。

source: This feature is incubating, but currently offers the ability to change the group, name and/or version of a requested dependency, allowing a dependency to be substituted with a completely different module during resolution.
zh_cn: 此功能还在孵化中，但目前提供了对于一个请求的依赖更改组、 名称及版本的功能，允许在解析过程中，把一个依赖替换为另一个完全不同的模块。

source: This feature is helpful if you work with tasks provided by Gradle.
zh_cn: 如果您使用由 Gradle 提供的任务，那么此功能将非常有用。

source: This feature will be provided once Sonar Runner 2.1 has been released and adopted by the Sonar Runner plugin.
zh_cn: 一旦 Sonar Runner 2.1 发布，将提供这个功能，并由 Sonar Runner 插件采用。

source: This filter defines a boolean expression for which Gradle artifact it accepts.
zh_cn: 这个过滤器为每一个它接受的 Gradle 构件定义了一个布尔表达式。

source: This format is supported by many other tools, such as CI servers.
zh_cn: 这种格式可以被许多工具所支持，比如CI服务器。

source: This functionality is provided by the 'windows-resources' plugin.
zh_cn: 这个功能是由'windows-resources' 插件所提供的。

source: This has led to external solutions often based on build tools.
zh_cn: 这导致了外部的解决方案通常都会基于构建工具。

source: This has the benefit that the task class is automatically compiled and included in the classpath of the build script without you having to do anything.
zh_cn: 这样做的好处是，你不需要再做什么，这个任务类就能够被自动地编译并且包含到这个构建脚本的类路径当中。

source: This include all resource files and all Java source files.
zh_cn: 包含所有的资源文件和Java源文件。

source: This includes all Maven metadata manipulation and works also for Maven snapshots.
zh_cn: 这包括所有的 Maven 元数据操纵，并且 Maven snapshot一样可用。

source: This includes all build scripts, initialization scripts, and other scripts.
zh_cn: 这包括所有构建脚本，初始化脚本和其他脚本。

source: This includes the jar task for project dependencies included in the compile configuration.
zh_cn: 这包括了用于编译配置中包含的项目依赖关系的jar任务。

source: This includes things such as system properties, JVM arguments, and the Java executable to use.
zh_cn: 这包括系统属性、 JVM 参数和使用的Java 可执行文件。

source: This includes, but is not limited to, projects, tasks, and source sets.
zh_cn: 这包括但并不限于项目（project）、任务（task）和源码集（source set）。

source: This interface extends the SLF4J Logger interface and adds a few Gradle specific methods to it.
zh_cn: 该接口扩展自 SLF4J的 Logger接口，并添加了几个 Gradle 的特有方法。

source: This is Gradle's default strategy, and is often an appropriate choice as long as versions are backwards-compatible.
zh_cn: 这是 Gradle 的默认策略，只要版本都能向后兼容，往往是合适的选择。

source: This is a container for the project's source sets, of type SourceSetContainer.
zh_cn: 这是项目的源集的容器，它的类型是 SourceSetContainer。

source: This is a key feature to create builds that are reliable and reproducible in any environment.
zh_cn: 这是一个关键的功能，能在任何环境中创建可靠，重复性好的构建。

source: This is a multi-project build with a root project water and a subproject bluewhale.
zh_cn: 这是一个多项目构建，它有一个根项目water，和一个子项目bluewhale。

source: This is a reason why some projects prefer to store their libraries in their version control system.
zh_cn: 这也是为什么一些项目更愿意把他们的库存储于他们的版本控件系统的原因。

source: This is a redundancy and not very nice to read.
zh_cn: 这显得很冗余并且很不好读。
